===
numbers
===

1
1.0
-1
-1.0

---

(program
  (number)
  (number)
  (number)
  (number))

===
strings
===

"string"
"string\""

---

(program
  (string)
  (string))

===
quoted value
===

'[]
`123
`(+ ,a ,b)
`("")

---
(program
  (quoted_value
    (sequential_table))
  (quoted_value
    (number))
  (quoted_value
    (function_call
      name: (identifier)
      (unquoted_value
        (identifier))
      (unquoted_value
        (identifier))))
  (quoted_value
    (function_call
      name: (string))))

===
identifiers
===

a
?a
a?
$1
$
<>
test#test#test

---

(program
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier))

===
booleans + nil
===

true
false
nil

---

(program
  (boolean)
  (boolean)
  (nil))

===
tables
===

{: value
 "key" value
 "number" 531
 "f" (fn [x] (+ x 2))}
{key value}

---

(program
  (table
    (identifier)
    (identifier)
    (string)
    (identifier)
    (string)
    (number)
    (string)
    (function_definition
      (parameters
        (identifier))
      body: (function_call
              name: (identifier)
              (identifier)
              (number))))
  (table
    (identifier)
    (identifier)))

===
sequential tables
===

["abd" "def" "xyz"]

---

(program
  (sequential_table
    (string)
    (string)
    (string)))

===
comments
===

; this is a comment
(fn ;
 foo ;
 [ ;
 x ;
 ] ;
 x ;
 ) ;

---

(program
  (comment)
  (function_definition
    (comment)
    name: (identifier)
    (comment)
    (parameters
      (comment)
      (identifier)
      (comment))
    (comment)
    body: (identifier)
    (comment))
  (comment))

===
field
===

:test
:*
:#
:?
:-
:+
:9
:_
:/
:<
:>
:=
:^

---

(program
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field)
  (field))

===
field expressions
===

(string.format "%d" 1)

---

(program
  (function_call
    name: (field_expression
            (identifier)
            (identifier))
    (string)
    (number)))

===
vararg
===

...
(fn [x y ...] ...)

---

(program
  (vararg)
  (function_definition
    (parameters
      (identifier)
      (identifier)
      (vararg))
    body: (vararg)))
